app/controllers/monthly_budgets_controller.rb

INSERT INTO "monthly_budgets" ("month", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["month", "November"], ["user_id", 3], ["created_at", 2017-03-25 16:39:33 UTC], ["updated_at", 2017-03-25 16:39:33 UTC]]
---
  def create
    @monthly_budget = MonthlyBudget.new monthly_budget_params

    if @monthly_budget.save