app/views/categories/index.html.erb

        <td><%= category.target %></td>
        <td><%= category.expenses.pluck('amount_spent').sum %></td>
---
SELECT "expenses"."amount_spent" FROM "expenses" WHERE "expenses"."category_id" = $1  [["category_id", 1]]